export interface Martyr {
  id: string;
  name: string;
  birthPlace: string;
  burialPlace: string;
  martyrdomDate: string; // YYYY/MM/DD
  birthDate: string; // YYYY/MM/DD
  imageUrl: string;
  shortBio: string;
  fullBio: string;
}

export const martyrsData: Martyr[] = [
  {
    id: "1",
    name: "شهید سید مرتضی آوینی",
    birthPlace: "ری",
    burialPlace: "تهران، بهشت زهرا",
    martyrdomDate: "1372/01/20",
    birthDate: "1326/06/21",
    imageUrl: "slider/1.jpg",
    shortBio:
      "مستندساز، عکاس، روزنامه‌نگار، نویسنده و نظریه‌پرداز سینمای اسلامی",
    fullBio:
      "سید مرتضی آوینی (۲۱ شهریور ۱۳۲۶ – ۲۰ فروردین ۱۳۷۲) مستندساز، عکاس، روزنامه‌نگار، نویسنده و نظریه‌پرداز «سینمای اسلامی» ایرانی بود. وی در سال ۱۳۷۲ در فکه بر اثر اصابت ترکش مین به شهادت رسید.",
  },
  {
    id: "2",
    name: "شهید مصطفی چمران",
    birthPlace: "تهران",
    burialPlace: "تهران، بهشت زهرا",
    martyrdomDate: "1360/03/31",
    birthDate: "1311/07/07",
    imageUrl: "slider/1.jpg",
    shortBio:
      "فیزیک‌دان، سیاستمدار، وزیر دفاع و از فرماندهان جنگ",
    fullBio:
      "مصطفی چمران ساوه‌ای (۷ مهر ۱۳۱۱ – ۳۱ خرداد ۱۳۶۰) فیزیک‌دان، فعال سیاسی، از اعضای نهضت آزادی ایران، وزیر دفاع دولت موقت، نماینده دوره اول مجلس شورای اسلامی و از فرماندهان ایران در جنگ ایران و عراق بود. وی در دهلاویه به شهادت رسید.",
  },
  {
    id: "3",
    name: "شهید محمد ابراهیم همت",
    birthPlace: "شهرضا",
    burialPlace: "شهرضا",
    martyrdomDate: "1362/12/17",
    birthDate: "1334/01/12",
    imageUrl: "slider/1.jpg",
    shortBio:
      "معلم و نظامی ایرانی، فرمانده لشکر ۲۷ محمد رسول‌الله",
    fullBio:
      "محمدابراهیم همت (۱۲ فروردین ۱۳۳۴ – ۱۷ اسفند ۱۳۶۲) معلم و نظامی ایرانی بود که از فرماندهان ارشد سپاه پاسداران در جنگ ایران و عراق به‌شمار می‌رفت. وی در عملیات خیبر در جزیره مجنون به شهادت رسید.",
  },
  {
    id: "4",
    name: "شهید مهدی باکری",
    birthPlace: "میاندوآب",
    burialPlace: "اروندرود (مفقودالاثر)",
    martyrdomDate: "1363/12/25",
    birthDate: "1333/01/30",
    imageUrl: "slider/1.jpg",
    shortBio: "فرمانده لشکر ۳۱ عاشورا",
    fullBio:
      "مهدی باکری (۳۰ فروردین ۱۳۳۳ – ۲۵ اسفند ۱۳۶۳) نظامی ایرانی بود که در طول جنگ ایران و عراق از فرماندهان ارشد سپاه پاسداران انقلاب اسلامی محسوب می‌شد و فرماندهی لشکر ۳۱ عاشورا را برعهده داشت. وی در عملیات بدر به شهادت رسید و پیکرش در اروندرود مفقود شد.",
  },
];